# 1. Import library

In [1]:
import pandas as pd
import numpy as np
import warnings

# 2. Read csv

In [2]:
df = pd.read_csv('../Data/scrapped data.csv')

In [3]:
df

,Designation,Name,Location,Level_and_involvement,Total_applicants,Industry_and_Employee_count,LinkedIn_Followers
0,Quality Analyst Automation,Uplers,"Jaipur, Rajasthan, India",Full-time · Associate,122 applicants,"1,001-5,000 employees · IT Services and IT Con...","668,044 followers"
1,QA Automation Tester,Uplers,"Jaipur, Rajasthan, India",Full-time · Associate,NaN,"1,001-5,000 employees · IT Services and IT Con...","668,044 followers"
2,Technology Analyst - Mainframe (3-5 years) - J...,Infosys,"Jaipur, Rajasthan, India",Full-time · Associate,29 applicants,"10,001+ employees · IT Services and IT Consulting","6,456,621 followers"
3,Web Developer - Python,Uplers,"Chennai, Tamil Nadu, India",Full-time · Mid-Senior level,161 applicants,"1,001-5,000 employees · IT Services and IT Con...","668,044 followers"
4,Web Developer - Python,Uplers,"Noida, Uttar Pradesh, India",Full-time · Mid-Senior level,75 applicants,"1,001-5,000 employees · IT Services and IT Con...","668,044 followers"
...,...,...,...,...,...,...,...
335,Android Developer- WFH,Uplers,"Bengaluru, Karnataka, India",Full-time · Mid-Senior level,41 applicants,"1,001-5,000 employees · IT Services and IT Con...","668,162 followers"
336,Assistant Manager-BFS024323,Genpact,"Bengaluru, Karnataka, India",Full-time · Associate,25 applicants,"10,001+ employees · IT Services and IT Consulting",NaN
337,Developer,Wipro,"Delhi, Delhi, India",Full-time · Entry level,NaN,"10,001+ employees · IT Services and IT Consulting",NaN
338,Assurance - Consultant,EY,"Kolkata, West Bengal, India",Full-time · Associate,8 applicants,"10,001+ employees · Accounting",NaN
339,Technical Lead,Wipro,"Bengaluru, Karnataka, India",Full-time · Mid-Senior level,51 applicants,"10,001+ employees · IT Services and IT Consulting",NaN

# 3. Check nulls

In [4]:
df.isnull().sum()

Designation                      0
Name                             0
Location                         0
Level_and_involvement            0
Total_applicants                41
Industry_and_Employee_count      0
LinkedIn_Followers             208
dtype: int64

# 4. Check Duplicates

In [5]:
df.duplicated().sum()

4

# 5. Break down of Level_and_involvement column

In [6]:
df[['Level','Involvement']] = df['Level_and_involvement'].str.split('·', expand=True)

# 6. Remove noise and unwanted text from Total_applicants column

In [7]:
df['Total_applicants'] = df['Total_applicants'].str.replace(' applicants', '').str.replace(' applicant', '').fillna(0).astype(int)

# 7. Break down of Industry_and_Employee_count column

In [8]:
df[['Employee_count','Industry']] = df['Industry_and_Employee_count'].str.split('·', expand=True)

# 8. Remove noise and unwanted text from Employee_count column

In [9]:
warnings.filterwarnings('ignore', category=FutureWarning)
df['Employee_count'] = df['Employee_count'].str.replace(',', '').str.replace(' employees', '').str.replace('+', '').str[-6:].str.replace('-', '').astype(int)

# 9. Remove noise and unwanted text from LinkedIn_Followers column

In [10]:
df['LinkedIn_Followers'] = df['LinkedIn_Followers'].str.replace(' followers', '').str.replace(',', '')

# 10. Remove noise and replace data points of LinkedIn_Followers column

In [11]:
followers = {'Uplers': 668410,
             'Infosys': 6457687,
             'Sutherland': 480832,
             'Genpact': 2258530,
             'Accenture in India': 1494146,
             'Wipro': 6404693,
             'Tata Consultancy Services': 11324016,
             'UST': 724373,
             'LTIMindtree': 58311,
             'JLL': 1596438,
             'EY': 6953289,
             'Vodafone Idea Limited': 225455}

for x in followers:
    df.loc[df['Name'] == x, 'LinkedIn_Followers'] = followers[x]

# 11. Break down of Location column

In [12]:
df[['city','state','country']] = df['Location'].str.split(",", expand=True)

# 12. Delete all unwanted columns from data frame

In [13]:
df.drop(['Location','Level_and_involvement', 'Industry_and_Employee_count'], axis=1, inplace = True)

# 13. Drop Duplicates

In [14]:
df.drop_duplicates(inplace = True)

# 14. Jobs table

In [15]:
jobs = df[['city','state','country','Designation']].copy()

In [16]:
jobs['job_id'] = [i for i in range(1, 335)]

In [17]:
jobs = jobs[['job_id', 'Designation', 'city','state','country']].copy()

In [18]:
jobs['Details_id'] =  [i for i in range(1001, 1335)]

In [19]:
jobs

,job_id,Designation,city,state,country,Details_id
0,1,Quality Analyst Automation,Jaipur,Rajasthan,India,1001
1,2,QA Automation Tester,Jaipur,Rajasthan,India,1002
2,3,Technology Analyst - Mainframe (3-5 years) - J...,Jaipur,Rajasthan,India,1003
3,4,Web Developer - Python,Chennai,Tamil Nadu,India,1004
4,5,Web Developer - Python,Noida,Uttar Pradesh,India,1005
...,...,...,...,...,...,...
335,330,Android Developer- WFH,Bengaluru,Karnataka,India,1330
336,331,Assistant Manager-BFS024323,Bengaluru,Karnataka,India,1331
337,332,Developer,Delhi,Delhi,India,1332
338,333,Assurance - Consultant,Kolkata,West Bengal,India,1333
339,334,Technical Lead,Bengaluru,Karnataka,India,1334

# 15. Company table

In [20]:
company = df[['Name', 'Industry', 'Employee_count', 'LinkedIn_Followers']].copy()

In [21]:
ids = dict(zip(company['Name'].unique(), [i for i in range(5001, 5013)]))

for i in ids:
    company.loc[company['Name'] == i, 'Company_id'] = int(ids[i])

In [22]:
company['Company_id'] = company['Company_id'].astype(int)

In [23]:
jobs['Company_id'] = company['Company_id']

In [24]:
company.drop_duplicates(inplace = True)

In [25]:
company = company[['Company_id', 'Name', 'Industry', 'Employee_count', 'LinkedIn_Followers']].copy()

In [26]:
company

,Company_id,Name,Industry,Employee_count,LinkedIn_Followers
0,5001,Uplers,IT Services and IT Consulting,5000,668410
2,5002,Infosys,IT Services and IT Consulting,10001,6457687
14,5003,Sutherland,IT Services and IT Consulting,10001,480832
17,5004,Genpact,IT Services and IT Consulting,10001,2258530
32,5005,Accenture in India,IT Services and IT Consulting,10001,1494146
38,5006,Wipro,IT Services and IT Consulting,10001,6404693
49,5007,Tata Consultancy Services,IT Services and IT Consulting,10001,11324016
60,5008,UST,IT Services and IT Consulting,10001,724373
70,5009,LTIMindtree,IT Services and IT Consulting,10001,58311
78,5010,JLL,Real Estate,10001,1596438
92,5011,EY,Accounting,10001,6953289
116,5012,Vodafone Idea Limited,Telecommunications,10001,225455

# 16. Details table

In [27]:
details = df[['Involvement', 'Level', 'Total_applicants']].copy()

In [28]:
details['Details_id'] =[i for i in range(1001, 1335)]

In [29]:
details = details[['Details_id', 'Involvement', 'Level', 'Total_applicants']]

In [30]:
details

     Details_id        Involvement       Level  Total_applicants
0          1001          Associate  Full-time                122
1          1002          Associate  Full-time                  0
2          1003          Associate  Full-time                 29
3          1004   Mid-Senior level  Full-time                161
4          1005   Mid-Senior level  Full-time                 75
..          ...                ...         ...               ...
335        1330   Mid-Senior level  Full-time                 41
336        1331          Associate  Full-time                 25
337        1332        Entry level  Full-time                  0
338        1333          Associate  Full-time                  8
339        1334   Mid-Senior level  Full-time                 51

[334 rows x 4 columns]

# 17. Store all the Tables locally for analyzing

In [31]:
jobs.to_csv('../Data/jobs.csv', index = False)

In [32]:
company.to_csv('../Data/company.csv', index = False)

In [33]:
details.to_csv('../Data/details.csv', index = False)

# Thank You!